{
  "core_motivation": "You're driven to build something meaningful while maintaining work-life balance. You want to create value and generate income, but not at the expense of your personal time. Your motivation stems from wanting to prove you can succeed as a founder while staying true to your values.",
  
  "operating_constraints": "You have limited time (10-20 hrs/week), which means you need ideas that can be built incrementally without requiring full-time commitment. Your budget is minimal (Free/Sweat-equity only), so you'll need to bootstrap and use free/low-cost tools. You're working solo, so ideas must be manageable by one person initially. Your analytical/strategic skills are strong, but you may lack deep technical implementation expertise.",
  
  "opportunity_space": "Given your interest in AI / Automation, there are several high-opportunity areas: (1) AI-powered automation tools for small businesses - many SMBs lack technical expertise to implement AI, (2) Vertical AI solutions for specific industries - deeper, more valuable than horizontal tools, (3) AI agent frameworks and no-code AI builders - making AI accessible to non-technical users, (4) AI data infrastructure tools - cleaning, managing, preparing data for AI applications.",
  
  "strengths": "Your analytical and strategic thinking will help you identify market gaps and position your product effectively. Your ability to work solo means faster decision-making and lower overhead. Your interest in emerging technologies (AI) positions you well in a fast-growing market. Your balanced approach to work-life means you'll build sustainable, maintainable solutions.",
  
  "skill_gaps": "Limited technical implementation expertise may slow development of AI-powered features. Limited time means you'll need to prioritize ruthlessly and may struggle with complex technical learning curves. Limited budget means you can't hire help early, so you'll need to learn or use no-code tools.",
  
  "recommendations": "Focus on no-code/low-code AI tools initially to validate ideas quickly without deep technical implementation. Consider using existing AI APIs (OpenAI, Anthropic) rather than building from scratch. Start with a narrow, specific use case rather than trying to build a comprehensive platform.",
  
  "founder_psychology_summary": "You're a balanced builder - motivated but pragmatic, ambitious but realistic about constraints. You value sustainable growth over rapid scaling. You prefer working independently and making decisions quickly. You're comfortable with uncertainty but want to validate ideas before committing too much time or resources.",
  
  "clarifications_needed": "What specific AI/Automation use cases interest you most? Do you have any existing technical skills or are you starting from scratch? Are you open to partnerships or do you prefer to work completely solo? What's your risk tolerance - are you comfortable with unproven ideas or do you prefer more validated opportunities?"
}

